<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f2e4222abd4bff819e2255e6f647e0357f36f2ee3dedcf39048b848d15fa4e6b","plan_job_ref":"Job Terraform plan #46 at https://github.com/mkuthan/stream-processing/actions/runs/7962764254","plan_out_hash":"b4d1473921b4dca7788912b662479eeb0d9c6ad708dfe832ff8141fa779ec328","plan_hash":"45469012e094e68b8293ac786f667f0f3d95ec9ef8f358b054ecd9535d7c947e","plan_text_format":"diff","version":"1.41.2"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-entry"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-exit"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
+   resource "google_pubsub_subscription" "vehicle-registration-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "vehicle-registration"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #46](https://github.com/mkuthan/stream-processing/actions/runs/7962764254)